OrificeFlowmeter/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// Air at 20 C 
nu              [0  2 -1 0 0 0 0] 1.5e-05;

CrossPowerLawCoeffs
{
    nu0         [0 2 -1 0 0 0 0] 1e-06;
    nuInf       [0 2 -1 0 0 0 0] 1e-06;
    m           [0 0  1 0 0 0 0] 1;
    n           [0 0  0 0 0 0 0] 1;
}

BirdCarreauCoeffs
{
    nu0         [0 2 -1 0 0 0 0] 1e-06;
    nuInf       [0 2 -1 0 0 0 0] 1e-06;
    k           [0 0  1 0 0 0 0] 0;
    n           [0 0  0 0 0 0 0] 1;
}


// ************************************************************************* //
