OrificeFlowmeter/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Options laminar, RAS, LES 
simulationType          RAS;

RAS
{
    RASModel            kOmegaSST;

    turbulence          on;

    printCoeffs         on;

    //kOmegaSSTCoeffs
    //{
    //    Cmu           0.09;
    //    betaStar      0.09;
    //    sigmaK        1.0;
    //    C1            1.44;
    //    C2            1.92;
    //}
}

//RAS
//{
//    RASModel            kEpsilon;
//    turbulence          on;
//    printCoeffs         on;
//    kEpsilonCoeffs
//    {
//        Cmu         0.09;
//        C1          1.44;
//        C2          1.92;
//        sigmak      1.0;
//        sigmaEps    1.3;
//    }
//}

// ************************************************************************* //
