OrificeFlowmeter/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
    }

//    pFinal
//    {
//	    $p;
//	    relTol	0;
//    }

    U
    {
        solver          PBiCG;
	preconditioner	DILU;
        //smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
    }

    k
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
	nSweeps		2;
        tolerance       1e-06;
        relTol          0.1;
    }
    omega
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
	nSweeps		2;
        tolerance       1e-06;
        relTol          0.1;
    }

//    UFinal
//    {
//	    $U;
//	    relTol	0;
//    }
 
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;

//    pRefCell        0;
//    pRefValue       0;

 //   residualControl
 //   {
 //       p       1e-06;
 //       U       1e-06;
 //   }
}

relaxationFactors
{
    fields
    {
       p   0.3;
    }
    equations
    {
        U   0.3;
	k   0.3;
	omega 0.3;
    }
}


// ************************************************************************* //
